# Задание #9 к главе 2
# Текст задания находится в файле tasks_ru.txt
#
# Task #9 to chapter 2
# The text of the task is in the file tasks_en.txt

temp_c = float(input(f'Введите температуру в градусах по шкале Цельсия: '))
print(f'Ваша температура в градусах по шкале Фаренгейта: {((9/5)*temp_c)+32:.2f}')
