# Задание #3 к главе 2
# Текст задания находится в файле tasks_ru.txt
#
# Task #3 to chapter 2
# The text of the task is in the file tasks_en.txt

AKR = 4046.86

square_m = float(input(f'Введите площать участка в квадратных метрах: '))
print(f'Площадь вашего участка {square_m / AKR:.2f} акр(а))')
