# Задание #2 к главе 2
# Текст задания находится в файле tasks_ru.txt
#
# Task #2 to chapter 2
# The text of the task is in the file tasks_en.txt

sales = float(input(f'Введите планируемую сумму продаж: '))
print(f'Плановая прибыль, составит: ${sales * 0.23:,.2f}')
