# Эта программа демонстрирует конкатенацию строковх литерало.
first_name = input(f'Введите ваше имя: ')
last_name = input(f'Введите вашу фамилию: ')

# Обединить имена с пробелом между собой.
full_name = first_name + ' ' + last_name

# Вывести на экран полное имя пользвателя.
print(f'Ваше полное имя: {full_name}')
