# Присвоить значение переменной salary
salary = 25000.0

# Присвоить значение переменной bonus
bonus = 12000.0

# Рассчитать заработную плату до удержания, сложив solary
# и bonus. Присвоить результат переменной pay
pay = salary + bonus

# Вывести переменную pay
print(f'Ваша заработная плата: {pay}')
