# Создать переменные, которые ссылаются на два строковых значения.
first_name = 'Кэтрин'
last_name = 'Марино'

# Показать значение, на которое эти переменные ссылаются.
print(first_name, last_name)
